In [1]:
import pandas as pd
import numpy as np
import chardet as ch
import scipy.stats as st

## Primer ejercicio

In [2]:
nombre_archivo = 'machine.txt'

with open(nombre_archivo, 'rb') as f:
    result = ch.detect(f.read())
    codificacion_detectada = result['encoding']

data = pd.read_csv(nombre_archivo, delimiter='\t', encoding=codificacion_detectada)

In [3]:
df = data.copy()

In [4]:
df.columns = df.columns.str.lower().str.replace(" ","_")

In [5]:
df

   new_machine  ____old_machine
0         42.1             42.7
1         41.0             43.6
2         41.3             43.8
3         41.8             43.3
4         42.4             42.5
5         42.8             43.5
6         43.2             43.1
7         42.3             41.7
8         41.8             44.0
9         42.7             44.1

In [6]:
alpha = 0.05

In [7]:
_, p_value = st.ttest_rel(df["new_machine"], df["____old_machine"])

In [8]:
p_value

0.013540335651632521

In [9]:
if p_value > alpha:
    print("We are not able to reject the null hypothesis")
else:
    print("We reject the null hypothesis")

We reject the null hypothesis

## Segundo ejercicio

In [11]:
nombre_archivo2 = 'student_gpa.txt'

with open(nombre_archivo2, 'rb') as f:
    result = ch.detect(f.read())
    codificacion_detectada = result['encoding']

data2 = pd.read_csv(nombre_archivo2, delimiter='\t', encoding=codificacion_detectada)

In [12]:
df2 = data2.copy()

In [13]:
df2.columns = df2.columns.str.lower().str.replace(" ","_")

In [14]:
df2

    sophomores  __juniors
0         3.04       2.56
1         1.71       2.77
2         3.30       2.70
3         2.88       3.00
4         2.11       2.98
5         2.60       3.47
6         2.92       3.26
7         3.60       3.20
8         2.28       3.19
9         2.82       2.65
10        3.03       3.00
11        3.13       3.39
12        2.86       2.58
13        3.49        NaN
14        3.11        NaN
15        2.13        NaN
16        3.27        NaN

In [15]:
alpha2 = 0.05

In [23]:
_, p_value2 = st.ttest_ind(df2["sophomores"], df2['__juniors'], equal_var=False, nan_policy="omit")

In [25]:
p_value2

0.3642180675348571

In [26]:
if p_value2 > alpha:
    print("We are not able to reject the null hypothesis")
else:
    print("We reject the null hypothesis")

We are not able to reject the null hypothesis